const ENGLISH_LOWERCASE = [
  [
    '`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace',
  ],
  [
    'Tab', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '/', 'Del',
  ],
  [
    'CapsLock', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'", 'Enter',
  ],
  [
    'Shift', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/', '\u2191', 'en',
  ],
  [
    'Ctrl', 'Win', 'Alt', '', 'Alt', '\u2190', '\u2193', '\u2192', 'Ctrl',
  ],
];

const ENGLISH_UPPERCASE = [
  [
    '`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace',
  ],
  [
    'Tab', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '[', ']', '/', 'Del',
  ],
  [
    'CapsLock', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ';', "'", 'Enter',
  ],
  [
    'Shift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', ',', '.', '/', '\u2191', 'en',
  ],
  [
    'Ctrl', 'Win', 'Alt', '', 'Alt', '\u2190', '\u2193', '\u2192', 'Ctrl',
  ],
];

const RUSSIAN_LOWERCASE = [
  [
    'ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace',
  ],
  [
    'Tab', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\', 'Del',
  ],
  [
    'CapsLock', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'Enter',
  ],
  [
    'Shift', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.', '\u2191', 'en',
  ],
  [
    'Ctrl', 'Win', 'Alt', '', 'Alt', '\u2190', '\u2193', '\u2192', 'Ctrl',
  ],
];

const RUSSIAN_UPPERCASE = [
  [
    '`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace',
  ],
  [
    'Tab', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '\\', 'Del',
  ],
  [
    'CapsLock', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Д', 'Ж', 'Enter',
  ],
  [
    'Shift', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', '.', '\u2191', 'en',
  ],
  [
    'Ctrl', 'Win', 'Alt', '', 'Alt', '\u2190', '\u2193', '\u2192', 'Ctrl',
  ],
];

export {
  ENGLISH_LOWERCASE, ENGLISH_UPPERCASE, RUSSIAN_LOWERCASE, RUSSIAN_UPPERCASE,
};
